src/test/resources/custom-donations-subscription-success.json

{
  "id": "evt_3JWvHFHAwJOu5brr0b3CoObS",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1630986438,
  "data": {
    "object": {
      "id": "pi_3JWvHFHAwJOu5brr0jae8t9x",
      "object": "payment_intent",
      "amount": 5262,
      "amount_capturable": 0,
      "amount_received": 5262,
      "application": "ca_8EWYbbIrLgMorBWVOFdsZK8vLKHhZYCs",
      "application_fee_amount": 79,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3JWvHFHAwJOu5brr0FkjlRha",
            "object": "charge",
            "amount": 5262,
            "amount_captured": 5262,
            "amount_refunded": 0,
            "application": "ca_8EWYbbIrLgMorBWVOFdsZK8vLKHhZYCs",
            "application_fee": null,
            "application_fee_amount": 79,
            "balance_transaction": "txn_3JWvHFHAwJOu5brr0p4OZa03",
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": "46814",
                "state": null
              },
              "email": null,
              "name": "team+integration+tester@impactupgrade.com",
              "phone": null
            },
            "calculated_statement_descriptor": "IMPACT UPGRADE",
            "captured": true,
            "created": 1630986437,
            "currency": "usd",
            "customer": "cus_KBHqPAS8xHRjcM",
            "description": "Subscription creation",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {
            },
            "invoice": "in_1JWvHEHAwJOu5brroAyQol0R",
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 35,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3JWvHFHAwJOu5brr0jae8t9x",
            "payment_method": "card_1JWvHDHAwJOu5brrSqTrQ9Gb",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2022,
                "fingerprint": "WHTBeQ5HmOeHlWfu",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "network": "visa",
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/acct_1Imqu3HAwJOu5brr/ch_3JWvHFHAwJOu5brr0FkjlRha/rcpt_KBHq84x5fF8H4uGqj0cpDNU4DHAe9Zn",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3JWvHFHAwJOu5brr0FkjlRha/refunds"
            },
            "review": null,
            "shipping": null,
            "source": {
              "id": "card_1JWvHDHAwJOu5brrSqTrQ9Gb",
              "object": "card",
              "address_city": null,
              "address_country": null,
              "address_line1": null,
              "address_line1_check": null,
              "address_line2": null,
              "address_state": null,
              "address_zip": "46814",
              "address_zip_check": "pass",
              "brand": "Visa",
              "country": "US",
              "customer": "cus_KBHqPAS8xHRjcM",
              "cvc_check": "pass",
              "dynamic_last4": null,
              "exp_month": 12,
              "exp_year": 2022,
              "fingerprint": "WHTBeQ5HmOeHlWfu",
              "funding": "credit",
              "last4": "4242",
              "metadata": {
              },
              "name": "team+integration+tester@impactupgrade.com",
              "tokenization_method": null
            },
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3JWvHFHAwJOu5brr0jae8t9x"
      },
      "client_secret": "pi_3JWvHFHAwJOu5brr0jae8t9x_secret_NszNCQt8AM3QJX7VcbByHpWPs",
      "confirmation_method": "automatic",
      "created": 1630986437,
      "currency": "usd",
      "customer": "cus_KBHqPAS8xHRjcM",
      "description": "Subscription creation",
      "invoice": "in_1JWvHEHAwJOu5brroAyQol0R",
      "last_payment_error": null,
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": "off_session",
      "shipping": null,
      "source": "card_1JWvHDHAwJOu5brrSqTrQ9Gb",
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 3,
  "request": {
    "id": "req_edEO16q6SHR8YK",
    "idempotency_key": "aff39dbc-1864-47b2-9f45-34bfd39bfc39"
  },
  "type": "payment_intent.succeeded"
}